pets2/app/views/considers/_consider.html.erb

SELECT "line_pets".* FROM "line_pets" WHERE "line_pets"."consider_id" = ?  [["consider_id", 980190962]]
SELECT "pets".* FROM "pets" ORDER BY "pets"."updated_at" DESC LIMIT 1
SELECT 1 AS one FROM "line_pets" WHERE "line_pets"."consider_id" = ? LIMIT 1  [["consider_id", 980190962]]
---
<% unless consider.line_pets.empty? %>