pets2/app/views/considers/show.html.erb

<ul>
  <% @consider.line_pets.each do |animal| %>
---
SELECT "line_pets".* FROM "line_pets" WHERE "line_pets"."consider_id" = ?  [["consider_id", 1]]