pets2/app/views/foster/index.html.erb


<% cache ['foster', Pet.latest] do %>
---
SELECT "pets".* FROM "pets" ORDER BY name