pets2/app/controllers/considers_controller.rb

  def index
    @considers = Consider.all
---
SELECT "considers".* FROM "considers"

  def create
    @consider = Consider.new(consider_params)

    respond_to do |format|
      if @consider.save
---
INSERT INTO "considers" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 19 Feb 2014 01:35:28 UTC +00:00], ["updated_at", Wed, 19 Feb 2014 01:35:28 UTC +00:00]]

  def destroy
    @consider.destroy if @consider.id == session[:consider_id]
---
DELETE FROM "considers" WHERE "considers"."id" = ?  [["id", 980190962]]

    def set_consider
      @consider = Consider.find(params[:id])
---
SELECT "considers".* FROM "considers" WHERE "considers"."id" = ? LIMIT 1  [["id", "980190962"]]