pets2/app/controllers/foster_controller.rb

  def index
    @pets = Pet.order(:name)
---
SELECT "pets".* FROM "pets" ORDER BY "pets"."name" ASC