pets2/app/controllers/foster_controller.rb

  def index
    @pets = Pet.all
---
SELECT "pets".* FROM "pets" ORDER BY "pets"."updated_at" DESC LIMIT 1

  def agreement
    @pet = Pet.find(params[:pet_id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? ORDER BY name LIMIT 1  [["id", "4"]]