pets2/app/controllers/foster_controller.rb

  def index
    @pets = Pet.where(status: 'Available').order(:name).all
---
SELECT "pets".* FROM "pets" WHERE "pets"."status" = 'Available' ORDER BY "pets"."name" ASC