pets2/app/controllers/line_pets_controller.rb

SELECT "line_pets".* FROM "line_pets"
---
  def index
    @line_pets = LinePet.all

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "considers" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 19 Feb 2014 01:35:29 UTC +00:00], ["updated_at", Wed, 19 Feb 2014 01:35:29 UTC +00:00]]
INSERT INTO "line_pets" ("consider_id", "created_at", "pet_id", "updated_at") VALUES (?, ?, ?, ?)  [["consider_id", 980190963], ["created_at", Wed, 19 Feb 2014 01:35:29 UTC +00:00], ["pet_id", 207281424], ["updated_at", Wed, 19 Feb 2014 01:35:29 UTC +00:00]]
---
  def create
    pet = Pet.find(params[:pet_id])
    @line_pet = @consider.line_pets.build(pet: pet)

    respond_to do |format|
      if @line_pet.save

DELETE FROM "line_pets" WHERE "line_pets"."id" = ?  [["id", 980190962]]
---
  def destroy
    @line_pet.destroy

SELECT "line_pets".* FROM "line_pets" WHERE "line_pets"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_line_pet
      @line_pet = LinePet.find(params[:id])