pets2/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" ORDER BY name, breed desc
---
  def index
    @pets = Pet.order(sort_column + " " + sort_direction)

INSERT INTO "pets" ("age", "breed", "created_at", "habits", "image_url", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save

UPDATE "pets" SET "name" = ?, "breed" = ?, "image_url" = ?, "age" = ?, "habits" = ?, "status" = ?, "updated_at" = ? WHERE "pets"."id" = 980190962
---
  def update
    respond_to do |format|
      if @pet.update(pet_params)

DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 980190962]]
---
  def destroy
    @pet.destroy

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? ORDER BY name LIMIT 1  [["id", "4"]]
---
    def set_pet
      @pet = Pet.find(params[:id])